DockerLamp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-01 ה' 17:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Making and using  simple LAMP docker container.</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yisrael Dov Lebow" />
</head>
<body>
<div id="content">
<h1 class="title">Making and using  simple LAMP docker container.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4ca1a64">1. Why?</a></li>
<li><a href="#orgebf2f1a">2. Installing Docker</a></li>
<li><a href="#orgc1fc9ce">3. Docker Compose</a>
<ul>
<li><a href="#org57c5647">3.1. The Lamp PHP</a>
<ul>
<li><a href="#orgae76469">3.1.1. Docker file</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4ca1a64" class="outline-2">
<h2 id="org4ca1a64"><span class="section-number-2">1</span> Why?</h2>
<div class="outline-text-2" id="text-1">
<p>
Most of the tutorials and packages like laradock are not so straight
forward or are bloated. I Just want a simple docker container for my
LAMP project. 
</p>
</div>
</div>

<div id="outline-container-orgebf2f1a" class="outline-2">
<h2 id="orgebf2f1a"><span class="section-number-2">2</span> Installing Docker</h2>
<div class="outline-text-2" id="text-2">
<p>
First you will need to install <code>docker</code> and <code>docker-compose</code>. On
Debian based Linux (Ubuntu) you can do this with an <code>apt-get</code>. For
other OSes check the docker website.
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo apt-get install docker docker-compose
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc1fc9ce" class="outline-2">
<h2 id="orgc1fc9ce"><span class="section-number-2">3</span> Docker Compose</h2>
<div class="outline-text-2" id="text-3">
<p>
Creating a <code>docker-compose.yml</code> file will let us specify all of the
containers that we will need for our app and allow us to share the
specs for building it.
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #fcaf3e;">version</span>: <span style="color: #e9b96e;">'2'</span>

</pre>
</div>

<p>
That just tells us what version of the docker-compose file we are
using, check what version your docker-compose can use. 
</p>

<p>
Now to start defining some services
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span class="linenr">1: </span><span style="color: #fcaf3e;">services</span>: 
</pre>
</div>
</div>


<div id="outline-container-org57c5647" class="outline-3">
<h3 id="org57c5647"><span class="section-number-3">3.1</span> The Lamp PHP</h3>
<div class="outline-text-3" id="text-3-1">
<p>
We want to get a simple Apache server with <code>modphp</code>.
</p>

<p>
We are going to call this service <code>app</code> but you can replace that with
a more descriptive name for your project.
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span class="linenr"> 2: </span>  <span style="color: #73d216;"># </span><span style="color: #73d216;">The Application</span>
<span class="linenr"> 3: </span>  <span style="color: #fcaf3e;">app</span>:
<span class="linenr"> 4: </span>    <span style="color: #fcaf3e;">build</span>:
<span class="linenr"> 5: </span>      <span style="color: #fcaf3e;">context</span>: ./
<span class="linenr"> 6: </span>      <span style="color: #fcaf3e;">dockerfile</span>: docker/app.dockerfile
<span class="linenr"> 7: </span>    <span style="color: #fcaf3e;">working_dir</span>: /var/www
<span class="linenr"> 8: </span>    <span style="color: #fcaf3e;">volumes</span>:
<span class="linenr"> 9: </span>      - ./:/var/www
<span class="linenr">10: </span>    <span style="color: #fcaf3e;">ports</span>:
<span class="linenr">11: </span>      - ${DOCKER_HOST_HTTP_PORT}:80
<span class="linenr">12: </span>    <span style="color: #fcaf3e;">environment</span>:
<span class="linenr">13: </span>      - <span style="color: #e9b96e;">"DB_PORT=3306"</span>
<span class="linenr">14: </span>      - <span style="color: #e9b96e;">"DB_HOST=database"</span>
</pre>
</div>

<p>
Above we specified some details on how to build and run our app
</p>

<ul class="org-ul">
<li><code>dockefile:</code> Tells us what docker file to run when we build the app.</li>
<li><code>volumes:</code> Tells us what host volumes to map in the container when
we run.</li>
<li><code>ports:</code> lets us expose a port on the container to
<code>localhost</code>. <code>DOCKER_HOST_HTTP_PORT</code> will be replaced by the
environment variable with the same name. This lets us avoid a port
conflict if you have a local web-server running already on
port 80. So you can use something like port 8000 and access your
container at <a href="http://localhost:8000/">http://localhost:8000/</a> and that will got to port 80 on
the container.</li>
<li><code>environment:</code> sets up some environment variables in the</li>
</ul>
</div>



<div id="outline-container-orgae76469" class="outline-4">
<h4 id="orgae76469"><span class="section-number-4">3.1.1</span> Docker file</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Above we specified a docker file to use to create our application. 
</p>

<div class="org-src-container">
<pre class="src src-dockerfile"><span class="linenr">15: </span>FROM php:7.2-apache
</pre>
</div>

<p>
That will tell docker to build our image using the official PHP image
for 7.2 Apache.
</p>

<p>
Now we can try to run our server with 
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #e090d7;">export</span> <span style="color: #fcaf3e;">DOCKER_HOST_HTTP_PORT</span>=8000
docker-compose up -d
</pre>
</div>

<p>
<code>-d</code> tells us to run as a <b>daemon</b>, if you run without you will see
the log output. 
</p>

<p>
If everything worked there should now be a php server running on
<a href="http://localhost:8000/">http://localhost:8000/</a> 
</p>

<p>
First lets make a test php file in <code>html/index.php</code>
</p>

<div class="org-src-container">
<pre class="src src-php"><span class="linenr">1: </span><span style="color: #e090d7;">&lt;?php</span>
<span class="linenr">2: </span><span style="color: #b4fa70;">echo</span> <span style="color: #e9b96e;">"hello world"</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">curl -v http://localhost:8000
</pre>
</div>

<pre class="example">
hello world

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yisrael Dov Lebow</p>
<p class="date">Created: 2018-02-01 ה' 17:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
